read_verilog -lib +/ecp5/cells_sim.v
synth -top top -flatten -run :fine
opt -fast -full
memory_map
opt -full
techmap
dfflegalize -cell $_DFF_P_ 0
abc -lut 4
clean
techmap -map ../share/techmap.v
splitnets # for more predicatable FF names
autoname
blackbox =A:whitebox
